# Language Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..Language Property
ControlledApplication Class See Also
---
The language used in the current session of Revit.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LanguageType Language { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Language As LanguageType
	Get
```

Visual C++
---
```text
public:
property LanguageType Language {
	LanguageType get ();
}
```

# Remarks
Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.
# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace